tap "homebrew/bundle"
tap "homebrew/services"

brew "act"

brew "freetype"

brew "glib"

brew "libtiff"

brew "gdk-pixbuf"

brew "harfbuzz"

brew "pango"

brew "librsvg"

brew "little-cms2"

brew "jpeg-xl"

brew "webp"

brew "aom"

brew "appstream"

brew "autocorrect"

brew "zoxide"

brew "libgit2"

brew "glab"

brew "bat"

brew "bat-extras"

brew "binutils"

brew "bzip2"

brew "chart-testing"

brew "chezmoi"

brew "cloudflared"

brew "cmake"

brew "coreutils"

brew "create-dmg"

brew "croc"

brew "curl"

brew "difftastic"

brew "duckdb"

brew "e2b"

brew "etcd", restart_service: :changed

brew "fail2ban"

brew "fd"

brew "ffmpeg"

brew "fzf"

brew "gawk"

brew "gcc"

brew "libavif"

brew "gd"

brew "gh"

brew "gist"

brew "libiconv"

brew "git"

brew "git-filter-repo"

brew "git-lfs"

brew "unbound"

brew "gnutls"

brew "gnu-getopt"

brew "gnu-sed"

brew "netpbm"

brew "graphviz"

brew "gtk4"

brew "guile"

brew "hstr"

brew "htop"

brew "httpie"

brew "ifstat"

brew "imagemagick"

brew "iperf3"

brew "iproute2mac"

brew "jid"

brew "jj"

brew "jq"

brew "kind"

brew "libadwaita"

brew "mingw-w64"

brew "mtr"

brew "neovim"

brew "nexttrace"

brew "ninja"

brew "tmux"

brew "pandoc"

brew "poppler"

brew "postgresql@17", restart_service: :changed

brew "pre-commit"

brew "progress"

brew "protobuf"

brew "pv"

brew "qemu"

brew "rclone"

brew "redis", restart_service: :changed

brew "restic"

brew "resvg"

brew "ripgrep"

brew "s3cmd"

brew "samba"

brew "sevenzip"

brew "shellcheck"

brew "shfmt"

brew "socat"

brew "telnet"

brew "tig"

brew "tldr"

brew "tree"

brew "trivy"

brew "vim"

brew "websocat"

brew "wget"

brew "yq"

brew "zsh"
brew "zellij"

brew "tokei"

cask "android-platform-tools"

cask "bitwarden"

cask "dotnet-sdk"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"

cask "ghostty"

cask "google-chrome"

cask "thaw"

cask "macfuse"

cask "obs"

cask "orbstack"
cask "raycast"
cask "stats"
cask "zulu"

npm "@angular/cli"
npm "@google/gemini-cli"
npm "@microsoft/inshellisense"
npm "@openai/codex"
npm "doctoc"
npm "opencommit"
npm "pnpm"
npm "ts-node"
npm "typescript-language-server"
npm "typescript"
