tap "bufbuild/buf"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "lihaoyun6/tap"
tap "mongodb/brew"
tap "streamnative/streamnative"
tap "teamookla/speedtest"
tap "xgadget-lab/nexttrace"
brew "freetype"
brew "glib"
brew "libtiff"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "appstream"
brew "argon2"
brew "autocorrect"
brew "python@3.11"
brew "autojump"
brew "autossh"
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "binutils"
brew "bottom"
brew "btop"
brew "bzip2"
brew "chart-testing"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "croc"
brew "csvtk"
brew "curl"
brew "difftastic"
brew "docker"
brew "duckdb"
brew "etcd", restart_service: :changed
brew "fastfetch"
brew "fd"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "flex"
brew "fx"
brew "fzf"
brew "gawk"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdu"
brew "gh"
brew "gist"
brew "git-lfs"
brew "gitui"
brew "gnu-getopt"
brew "netpbm"
brew "graphviz"
brew "gtk4"
brew "guile"
brew "openjdk@11"
brew "hadoop"
brew "helm"
brew "hstr"
brew "htop"
brew "httpie"
brew "hugo"
brew "ifstat"
brew "imagemagick"
brew "incus"
brew "iperf3"
brew "python@3.12"
brew "iproute2mac"
brew "jid"
brew "jq"
brew "kind"
brew "krb5"
brew "kubernetes-cli"
brew "lazygit"
brew "libadwaita"
brew "libiconv"
brew "maven"
brew "mingw-w64"
brew "mtr"
brew "neovim"
brew "nexttrace"
brew "ninja"
brew "node"
brew "node_exporter"
brew "openconnect"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "parquet-cli"
brew "poppler"
brew "pre-commit"
brew "progress"
brew "protobuf"
brew "pulsarctl"
brew "pv"
brew "python@3.10"
brew "qemu"
brew "rbw"
brew "rclone"
brew "redis", restart_service: :changed
brew "restic"
brew "resvg"
brew "ripgrep"
brew "ruby@2.7"
brew "s3cmd"
brew "samba"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "telnet"
brew "termshark"
brew "the_silver_searcher"
brew "thrift"
brew "tig"
brew "tldr"
brew "tmuxinator"
brew "tree"
brew "trivy"
brew "trurl"
brew "typst"
brew "virt-manager"
brew "virtualenv"
brew "vpn-slice"
brew "wget"
brew "wireguard-tools"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "bufbuild/buf/buf"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-community@4.4"
brew "teamookla/speedtest/speedtest"
cask "bitwarden"
cask "fig"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gitify"
cask "hiddenbar"
cask "hyper"
cask "jordanbaird-ice"
cask "localsend"
cask "macfuse"
cask "orbstack"
cask "quickrecorder"
cask "raycast"
cask "squirrel-app"
cask "stats"
cask "switchkey"
cask "temurin"
cask "warp"
cask "zulu"
vscode "aaron-bond.better-comments"
vscode "aleksandra.go-group-imports"
vscode "alexisvt.flutter-snippets"
vscode "antfu.file-nesting"
vscode "bierner.markdown-preview-github-styles"
vscode "boto3typed.boto3-ide"
vscode "bpfdeploy.bpftrace"
vscode "carsonoid.vscode-go-present-peek"
vscode "codeium.codeium"
vscode "davidanson.vscode-markdownlint"
vscode "dendron.dendron-paste-image"
vscode "donebd.vscode-keypromoter"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "fisheva.eva-theme"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hangxingliu.vscode-systemd-support"
vscode "hardhacker.hard-hacker-theme"
vscode "huacnlee.autocorrect"
vscode "huntertran.auto-markdown-toc"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kevinrose.vsc-python-indent"
vscode "maxnatchanon.go-struct-tag-autogen"
vscode "mrkou47.thrift-syntax-support"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "nisanthchunduru.copy-filepath-with-line-number"
vscode "njpwerner.autodocstring"
vscode "pbkit.vscode-pbkit"
vscode "pkief.material-icon-theme"
vscode "r3inbowari.gomodexplorer"
vscode "randomfractalsinc.vscode-data-table"
vscode "redhat.vscode-tekton-pipelines"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "semanticdiff.semanticdiff"
vscode "streetsidesoftware.code-spell-checker"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "tenninebt.vscode-koverage"
vscode "timonwong.shellcheck"
vscode "tooltitudeteam.tooltitude"
vscode "twxs.cmake"
vscode "wakatime.vscode-wakatime"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
